In [222]:
import pandas as pd
import numpy as np
from pandas import DataFrame
from pandas import Series
import datetime as dt

In [223]:
df_real_original = pd.read_csv('data.csv')
df_original = df_real_original.sample(frac=0.1)
df_original = df_original.sort_index()
df_original.head()

,date,count,month,week,day,hour,minute,hour_half,special_day,test_season,vacation
32,2018-04-01 10:05,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
34,2018-04-01 10:06,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
51,2018-04-01 10:21,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
59,2018-04-01 10:22,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
67,2018-04-01 10:35,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [224]:
from dateutil.parser import parse
df_original.date = df_original.date.apply(lambda x : parse(x))
df_original.head()

,date,count,month,week,day,hour,minute,hour_half,special_day,test_season,vacation
32,2018-04-01 10:05:00,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
34,2018-04-01 10:06:00,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
51,2018-04-01 10:21:00,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
59,2018-04-01 10:22:00,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
67,2018-04-01 10:35:00,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [225]:
df_original.date.head()

32   2018-04-01 10:05:00
34   2018-04-01 10:06:00
51   2018-04-01 10:21:00
59   2018-04-01 10:22:00
67   2018-04-01 10:35:00
Name: date, dtype: datetime64[ns]

jupyter 에서는 10% 데이터만 가지고 실험

In [226]:
df_original.week = df_original.date.apply(lambda x : x.strftime("week_%A"))
df_original.head()

,date,count,month,week,day,hour,minute,hour_half,special_day,test_season,vacation
32,2018-04-01 10:05:00,NaN,NaN,week_Sunday,NaN,NaN,NaN,NaN,NaN,NaN,NaN
34,2018-04-01 10:06:00,NaN,NaN,week_Sunday,NaN,NaN,NaN,NaN,NaN,NaN,NaN
51,2018-04-01 10:21:00,NaN,NaN,week_Sunday,NaN,NaN,NaN,NaN,NaN,NaN,NaN
59,2018-04-01 10:22:00,NaN,NaN,week_Sunday,NaN,NaN,NaN,NaN,NaN,NaN,NaN
67,2018-04-01 10:35:00,NaN,NaN,week_Sunday,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [227]:
df_original.hour = df_original.date.apply(lambda x : x.strftime("%H"))
df_original.minute = df_original.date.apply(lambda x: x.strftime("%M"))
df_original.head()

df_original.hour = df_original.hour.astype('int')
df_original.minute=  df_original.minute.astype('int')

In [228]:
range0 = []
range1 = []

range30 = []
for i in range(0,30,1) :
    range30.append(i)
    range0.append(0)

range60 = []
for i in range(30,60,1) :
    range60.append(i)
    range1.append(1)

df_original.minute = df_original.minute.replace(range30, range0)
df_original.minute = df_original.minute.replace(range60, range1)
df_original.head()

,date,count,month,week,day,hour,minute,hour_half,special_day,test_season,vacation
32,2018-04-01 10:05:00,NaN,NaN,week_Sunday,NaN,10,0,NaN,NaN,NaN,NaN
34,2018-04-01 10:06:00,NaN,NaN,week_Sunday,NaN,10,0,NaN,NaN,NaN,NaN
51,2018-04-01 10:21:00,NaN,NaN,week_Sunday,NaN,10,0,NaN,NaN,NaN,NaN
59,2018-04-01 10:22:00,NaN,NaN,week_Sunday,NaN,10,0,NaN,NaN,NaN,NaN
67,2018-04-01 10:35:00,NaN,NaN,week_Sunday,NaN,10,1,NaN,NaN,NaN,NaN

In [229]:
df_original.hour_half = df_original.loc[df_original.minute == 1].hour.apply(lambda a : a + 0.5)
df_original.hour_half.loc[df_original.minute == 0] = df_original.loc[df_original.minute == 0 ].hour.apply(lambda x : x)
df_original.head(10)

C:\Users\user\Anaconda3\lib\site-packages\pandas\core\indexing.py:190: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  self._setitem_with_indexer(indexer, value)

,date,count,month,week,day,hour,minute,hour_half,special_day,test_season,vacation
32,2018-04-01 10:05:00,NaN,NaN,week_Sunday,NaN,10,0,10.0,NaN,NaN,NaN
34,2018-04-01 10:06:00,NaN,NaN,week_Sunday,NaN,10,0,10.0,NaN,NaN,NaN
51,2018-04-01 10:21:00,NaN,NaN,week_Sunday,NaN,10,0,10.0,NaN,NaN,NaN
59,2018-04-01 10:22:00,NaN,NaN,week_Sunday,NaN,10,0,10.0,NaN,NaN,NaN
67,2018-04-01 10:35:00,NaN,NaN,week_Sunday,NaN,10,1,10.5,NaN,NaN,NaN
91,2018-04-01 10:49:00,NaN,NaN,week_Sunday,NaN,10,1,10.5,NaN,NaN,NaN
97,2018-04-01 10:51:00,NaN,NaN,week_Sunday,NaN,10,1,10.5,NaN,NaN,NaN
100,2018-04-01 11:00:00,NaN,NaN,week_Sunday,NaN,11,0,11.0,NaN,NaN,NaN
119,2018-04-01 11:09:00,NaN,NaN,week_Sunday,NaN,11,0,11.0,NaN,NaN,NaN
122,2018-04-01 11:10:00,NaN,NaN,week_Sunday,NaN,11,0,11.0,NaN,NaN,NaN

In [230]:
import random
df_original['count'] = df_original['count'].apply(lambda x  : random.randint(1, 4))
df_original.head()

,date,count,month,week,day,hour,minute,hour_half,special_day,test_season,vacation
32,2018-04-01 10:05:00,4,NaN,week_Sunday,NaN,10,0,10.0,NaN,NaN,NaN
34,2018-04-01 10:06:00,1,NaN,week_Sunday,NaN,10,0,10.0,NaN,NaN,NaN
51,2018-04-01 10:21:00,1,NaN,week_Sunday,NaN,10,0,10.0,NaN,NaN,NaN
59,2018-04-01 10:22:00,2,NaN,week_Sunday,NaN,10,0,10.0,NaN,NaN,NaN
67,2018-04-01 10:35:00,1,NaN,week_Sunday,NaN,10,1,10.5,NaN,NaN,NaN

In [231]:
df_original['date'] = pd.to_datetime(df_original['date']).values.astype('datetime64[D]')
df_original['month'] = df_original['date'].astype('str').str.slice(5, 7)
df_original['day'] = df_original['date'].astype('str').str.slice(8, 10)

In [232]:
df_original.head()

,date,count,month,week,day,hour,minute,hour_half,special_day,test_season,vacation
32,2018-04-01,4,04,week_Sunday,01,10,0,10.0,NaN,NaN,NaN
34,2018-04-01,1,04,week_Sunday,01,10,0,10.0,NaN,NaN,NaN
51,2018-04-01,1,04,week_Sunday,01,10,0,10.0,NaN,NaN,NaN
59,2018-04-01,2,04,week_Sunday,01,10,0,10.0,NaN,NaN,NaN
67,2018-04-01,1,04,week_Sunday,01,10,1,10.5,NaN,NaN,NaN

In [233]:
df_original['groupbycolumn'] = df_original.date.apply(lambda x : str(x.strftime("%Y%m%d")))
df_original['groupbycolumn'] =  df_original.groupbycolumn.apply(lambda x : str(x)) + df_original.hour_half.apply(lambda x : str(x))
df_original.head()

,date,count,month,week,day,hour,minute,hour_half,special_day,test_season,vacation,groupbycolumn
32,2018-04-01,4,04,week_Sunday,01,10,0,10.0,NaN,NaN,NaN,2018040110.0
34,2018-04-01,1,04,week_Sunday,01,10,0,10.0,NaN,NaN,NaN,2018040110.0
51,2018-04-01,1,04,week_Sunday,01,10,0,10.0,NaN,NaN,NaN,2018040110.0
59,2018-04-01,2,04,week_Sunday,01,10,0,10.0,NaN,NaN,NaN,2018040110.0
67,2018-04-01,1,04,week_Sunday,01,10,1,10.5,NaN,NaN,NaN,2018040110.5

In [234]:
df_groupedcolumn = df_original.groupby('groupbycolumn')['count'].sum()

In [235]:
df_original = df_original.drop_duplicates('groupbycolumn')

In [236]:
df_original = pd.merge(df_original, df_groupedcolumn, left_on = 'groupbycolumn', right_index = True)

In [237]:
df_original.head()

,date,count_x,month,week,day,hour,minute,hour_half,special_day,test_season,vacation,groupbycolumn,count_y
32,2018-04-01,4,04,week_Sunday,01,10,0,10.0,NaN,NaN,NaN,2018040110.0,8
67,2018-04-01,1,04,week_Sunday,01,10,1,10.5,NaN,NaN,NaN,2018040110.5,11
100,2018-04-01,1,04,week_Sunday,01,11,0,11.0,NaN,NaN,NaN,2018040111.0,41
164,2018-04-01,3,04,week_Sunday,01,11,1,11.5,NaN,NaN,NaN,2018040111.5,37
221,2018-04-01,3,04,week_Sunday,01,12,0,12.0,NaN,NaN,NaN,2018040112.0,35

In [238]:
df_original = df_original.drop(['count_x', 'groupbycolumn'] , axis = 1)
df_original.head()

,date,month,week,day,hour,minute,hour_half,special_day,test_season,vacation,count_y
32,2018-04-01,04,week_Sunday,01,10,0,10.0,NaN,NaN,NaN,8
67,2018-04-01,04,week_Sunday,01,10,1,10.5,NaN,NaN,NaN,11
100,2018-04-01,04,week_Sunday,01,11,0,11.0,NaN,NaN,NaN,41
164,2018-04-01,04,week_Sunday,01,11,1,11.5,NaN,NaN,NaN,37
221,2018-04-01,04,week_Sunday,01,12,0,12.0,NaN,NaN,NaN,35

In [239]:
df_original_with_dummies = pd.concat([df_original, pd.get_dummies(df_original.week)], axis = 1)

In [240]:
df_original_with_dummies = pd.concat([df_original_with_dummies, pd.get_dummies(df_original.hour_half)], axis= 1)

In [241]:
df_original_with_dummies.head()

,date,month,week,day,hour,minute,hour_half,special_day,test_season,vacation,...,19.0,19.5,20.0,20.5,21.0,21.5,22.0,22.5,23.0,23.5
32,2018-04-01,04,week_Sunday,01,10,0,10.0,NaN,NaN,NaN,...,0,0,0,0,0,0,0,0,0,0
67,2018-04-01,04,week_Sunday,01,10,1,10.5,NaN,NaN,NaN,...,0,0,0,0,0,0,0,0,0,0
100,2018-04-01,04,week_Sunday,01,11,0,11.0,NaN,NaN,NaN,...,0,0,0,0,0,0,0,0,0,0
164,2018-04-01,04,week_Sunday,01,11,1,11.5,NaN,NaN,NaN,...,0,0,0,0,0,0,0,0,0,0
221,2018-04-01,04,week_Sunday,01,12,0,12.0,NaN,NaN,NaN,...,0,0,0,0,0,0,0,0,0,0

In [244]:
df_original_with_dummies.to_csv('2nd_processed_dataset.csv', index = False)